packages/inductiva/inductiva-0.0.33.tar.gz/inductiva-0.0.33/inductiva/templates/wind_tunnel/openfoam/files/system/blockMeshDict_template.openfoam.jinja
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ({{ domain["x"][0] }} {{ domain["y"][0] }} {{ domain["z"][0] }})
    ({{ domain["x"][1] }} {{ domain["y"][0] }} {{ domain["z"][0] }})
    ({{ domain["x"][1] }} {{ domain["y"][1] }} {{ domain["z"][0] }})
    ({{ domain["x"][0] }} {{ domain["y"][1] }} {{ domain["z"][0] }})
    ({{ domain["x"][0] }} {{ domain["y"][0] }} {{ domain["z"][1] }})
    ({{ domain["x"][1] }} {{ domain["y"][0] }} {{ domain["z"][1] }})
    ({{ domain["x"][1] }} {{ domain["y"][1] }} {{ domain["z"][1] }})
    ({{ domain["x"][0] }} {{ domain["y"][1] }} {{ domain["z"][1] }})
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 8 8) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    frontAndBack
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
